[
  {
  "id":1,
  "title":"Thai green chicken curry" ,
  "imageurl": "https://img.jamieoliver.com/jamieoliver/recipe-database/oldImages/large/1575_2_1437576282.jpg?tr=w-800,h-1066",
  "ingredients": "",
  "shortdescription": "This deliciously fragrant Thai green curry really packs a flavour punch.",
  "fulldescription": "To make the curry paste, peel, roughly chop and place the garlic, shallots and ginger into a food processor.\n    Trim the lemongrass, remove the tough outer leaves, then finely chop and add to the processor. Trim and add the chillies along with the cumin and half the coriander (stalks and all). Blitz until finely chopped, add the fish sauce and blitz again.\n    Slice the chicken into 2.5cm strips. Heat 1 tablespoon of oil in a large pan on a medium heat, add the chicken and fry for 5 to 7 minutes, or until just turning golden, then transfer to a plate.\n    Tear the mushrooms into even pieces. Return the pan to a medium heat, add the mushrooms and fry for 4 to 5 minutes, or until golden. Transfer to a plate using a slotted spoon.\n    Reduce the heat to medium-low and add the Thai green paste for 4 to 5 minutes, stirring occasionally.\n    Pour in the coconut milk and 200ml of boiling water, crumble in the stock cube and add the lime leaves. Turn the heat up and bring gently to the boil, then simmer for 10 minutes, or until reduced slightly.\n    Stir in the chicken and mushrooms, reduce the heat to low and cook for a further 5 minutes, or until the chicken is cooked through, adding the mangetout for the final 2 minutes.\n    Season carefully to taste with sea salt and freshly ground black pepper. Pick, roughly chop and stir through the basil leaves and remaining coriander leaves. Serve with lime wedges and steamed rice.\n\n",
  "rating": 5
    },
  {
   "id":2,
  "title":"Jack Dee's rotisserie-style chicken" ,
  "imageurl": "https://img.jamieoliver.com/jamieoliver/recipe-database/117650246.jpg?tr=w-800,h-1066",
  "ingredients": "",
  "shortdescription": "The key to this beautiful French-style dish is roasting the chicken directly on the bars of the oven, so the chicken juices rain down on the potatoes as they cook.",
  "fulldescription": "Preheat the oven to 200°C/400ºF/gas 6 and get your oven racks into position – one in the middle and one just above.\n    Slice the potatoes in half lengthways and slice the tops off the garlic bulbs, then place in a shallow roasting tray. Season generously with sea salt and black pepper and drizzle with 1 teaspoon of olive oil, then set aside.\n    Using a large sharp knife, carefully cut down the back of the chicken and open it out flat. Rub the butter and a good pinch of salt and pepper all over both sides.\n    Place the potato tray on the bottom shelf of the oven, and the chicken directly onto the shelf above. Place the unpeeled onions on top of the chicken and roast for 1 hour 10 minutes, turning the potatoes regularly and brushing the chicken with the cooking juices using the rosemary sprigs.\n    Trim the beans and cook in boiling salted water for 5 minutes, or until tender. Finely chop the walnuts.\n    Spoon the mustard into a bowl, peel and finely grate in the garlic, then whisk in 1 tablespoon each of walnut oil and extra virgin olive oil and a dash of white wine vinegar. Season to perfection with salt and pepper.\n    Drain the beans and toss them in the dressing, then tip onto a serving plate and sprinkle with the walnuts.\n    Remove the chicken from the oven and leave to rest for a few minutes. Squash the onions and garlic out of their skins and toss through the potatoes. Serve with the chicken and green beans.\n\n",
  "rating": 4
    },
    {
    "id":3,
  "title":"Proper chicken pie" ,
  "imageurl": "https://img.jamieoliver.com/jamieoliver/recipe-database/100112120.jpg?tr=w-800,h-1066",
  "ingredients": "",
  "shortdescription": "This amazing homemade chicken pie is the perfect sharing dish. Beautiful crumbly pastry, tender pieces of chicken and sweet leeks cooked in a creamy cider sauce. What are you waiting for? Get stuck in. ",
  "fulldescription": "Use a large sharp knife to carefully cut down the back bone of the chicken, cutting it in half. Season with sea salt and black pepper.\n    Drizzle 1 tablespoon of oil into a large non-stick frying pan on a high heat. Add the chicken, skin-side down, and sear for 10 minutes, or until golden. Reserve the pan for the cabbage.\n    Meanwhile, chop the pancetta into 1cm chunks, pick in the thyme leaves and place in a large shallow casserole pan with 1 teaspoon of oil. Put it on a medium heat so the fat renders out, while you wash and trim the white part of the leek (save the green for making soup) and the celery. Peel the onion and carrot, then roughly chop all the veg into 1.5cm chunks and add to the pan. Cook for 10 minutes, or until softened.\n    Stir in 2 heaped tablespoons of flour, cook for 2 minutes, then pour in the cider. Let it bubble away for 2 minutes or until almost evaporated, then stir in the mustard and stock. Add the chicken breast-side down, bring to a simmer, then cover and cook on a low heat for 1 hour, or until the chicken is cooked through and tender.\n    Meanwhile, for the pastry, put the flour in a bowl with a good pinch of salt. Grate in the cold butter, then rub with your fingers until it resembles breadcrumbs. Pour in 100ml of cold water, mix with a fork, then bring together with your hands until it forms a dough, adding an extra splash of water if needed. Divide into 2 pieces – you will need ⅓ for the lid and ⅔ for the base – flatten with your hands and chill until needed.\n    Finely slice the mushrooms and set aside.\n    Transfer the chicken to a plate and shred the meat (discard the carcass).\n    Stir the mushrooms into the pan, followed by the shredded chicken and the crème fraîche, mix well and season to taste.\n    Strain the chicken mixture through a sieve over a clean pan to catch the liquid, gently pressing to help it along, and reserve for your gravy. Leave to cool.\n    Preheat the oven to 190°C/375°F/gas 5.\n    Lightly grease a 30cm pie dish with oil. Roll out the larger piece of pastry between 2 sheets of greaseproof paper to just a few millimetres thick and use it to line the dish – allow an overhang. Press firmly into the edges and up the sides of the dish.\n    Fill with the cooled chicken mixture, then carefully roll out and top with the remaining piece of pastry. Beat the egg and brush a little over the edge of the lid then fold over the overhang and press down gently to seal. Egg wash the pie all over, then make a small incision in the centre to let the steam escape and bake at the bottom of the oven for 1 hour, or until the pastry is golden and the pie is piping hot.\n    Click off and discard any tatty outer leaves from the cabbage, then cut in half. Halve the core, then finely slice. Roughly chop the rest into large chunks. Place the chicken pan on a high heat, add the cabbage stalks and fry for 2 minutes, then go in with the leaves and a splash of water and cook for 5 minutes more, or until softened and lightly charred. Stir in the mustard, then add a pinch of salt and white pepper with a splash of water, and simmer for 1 minute, tossing a few times.\n    Reheat the gravy and enjoy with the pie and cabbage. Delicious served with creamy mash.\n\n",
  "rating": 3.5},
  {  "id":4,
    "title":"Whole roasted ricotta pasta" ,
    "imageurl": "https://img.jamieoliver.com/jamieoliver/recipe-database/117867065.jpg?tr=w-800,h-1066",
    "ingredients": "",
    "shortdescription": "Brilliantly simple, this big-flavour pasta dish can be prepped in minutes, with incredible flavour and texture built up from its time in the oven. Kissed with herbs, oil and vinegar, this baked ricotta is a thing of real beauty. ",
    "fulldescription": "Preheat the oven to 180°C/350°F/gas 4. Pick most of the oregano leaves, then pound to a paste in a pestle and mortar with a pinch of sea salt. Peel and bash in the garlic, muddle in 3 tablespoons of oil and 1 tablespoon of vinegar, then season with black pepper.\n    Halve the cherry tomatoes, deseed and roughly chop the peppers, peel and roughly chop the onion, slice the chillies in half lengthways, and add it all to a large roasting tray along with the capers. Pour over most of the flavoured oil and toss together.\n    Make a little well in the centre of the tray, pop in the ricotta and rub all over with the remaining flavoured oil. Add a splash of water to the tray, place in the oven and roast for 50 minutes, or until the veggies are soft and just starting to caramalise.\n    With 10 minutes to go, cook the pasta in a pan of boiling salted water according to the packet instructions, then drain, reserving a mug of the starchy pasta water, and steam dry.\n    Carefully lift the ricotta onto a board. Tip the drained pasta and a little of the pasta water into the tray and gently shake to loosen all the sticky goodness from the bottom. Toss together, then tip into a serving dish and break the beautiful ricotta over the top. Pick over the remaining oregano leaves and grate over the Parmesan, then serve.\n\n",
    "rating": 3},
  {  "id":5,
    "title":"Summer tagliatelle" ,
    "imageurl": "https://img.jamieoliver.com/jamieoliver/recipe-database/94741158.jpg?tr=w-800,h-1066",
    "ingredients": "",
    "shortdescription": "",
    "fulldescription": "Pick most of the basil leaves into a pestle and mortar and bash to a paste with a pinch of sea salt. Peel and bash in the garlic, then pound in the almonds until fine.\n    Muddle in 4 tablespoons of oil, finely grate in the Parmesan, then squeeze in the lemon juice. Season to perfection, and tweak to your liking.\n    Scrub and finely slice the potato, trim just the stalks off the beans, then place both in a pan of boiling salted water with the tagliatelle and cook according to the pasta packet instructions.\n    Prep the delicate summer veg as necessary, adding them to the pan for the last 3 minutes. Drain, reserving a mugful of starchy cooking water, then toss with the pesto, loosening with a splash of reserved cooking water, if needed.\n    Drizzle with 1 tablespoon of oil, and finish with the remaining basil and a fine grating of Parmesan. Nice served with a crunchy seasonal salad.\n\n",
    "rating": 3.8},
  {  "id":6,
    "title":"Malaysian-style whole fish" ,
    "imageurl": "https://img.jamieoliver.com/jamieoliver/recipe-database/117867077.jpg?tr=w-800,h-1066",
    "ingredients": "",
    "shortdescription": "It’s really worth sourcing a banana leaf for this spectacular Friday Night sea bass dish. Incredible fragrance, amplified flavour and wonderful texture – it’s a real belter! ",
    "fulldescription": "Preheat the oven to 220°C/425°F/gas 7.\n    Whack the lemongrass against your work surface and remove the tough outer layer. Peel the shallot and ginger, deseed the chillies, then roughly chop everything with the lemongrass. Add to a large pestle and mortar with a good pinch of sea salt and the lime leaves (discard the stalks) and pound to a paste.\n    Toast the peanuts in a large frying pan over a medium heat for 3 minutes, or until golden, then bash half into the paste. Add the tomato purée and fish sauce, finely grate in the lime zest and squeeze in all the juice, then muddle together.\n    With a sharp knife, score the sea bass skin at 1cm intervals in a criss-cross fashion, then rub all over with the paste, both inside and out.\n    Get your banana leaf (if using), or tear off a piece of baking paper five times as long as the fish and fold it in half to give you double thickness. Place the fish in the middle, then fold over to seal the fish snuggly inside. Place on a large baking tray and roast for 25 minutes, or until the flesh is succulent and comes away easily from the bone.\n    To make the rice, drizzle the vegetable oil into a saucepan over a medium heat. Crumble in the creamed coconut, then squeeze in the lime juice, throwing in the squeezed lime halves. Tip in the rice and fry for 2 minutes, then pour over 1 mug of boiling water and turn down the heat to low. Cover and cook for 12 minutes, then remove from the heat and allow to steam for a further 3 minutes.\n    For the chilli pickle, finely slice the chillies and place in a small bowl with the sugar, vinegar and a pinch of salt, then mix together and leave aside.\n    Now make the salad. Crack open the coconut and finely grate 50g of flesh into a serving bowl. Halve the sugar snaps and mangetout, finely shred both cabbages and cucumber, then peel and finely slice the mango and add it all to the bowl. Pick in most of the herb leaves, squeeze over the lime juice and toss together.\n    Pop the fish on a serving platter. Roughly crush the remaining peanuts in a pestle and mortar, then scatter over the salad and the fish. Drizzle the fish with the soy sauce and scatter over the remaining salad herbs.\n    Take the fish, chilli pickle, rice and salad to the table and let everyone help themselves.\n\n",
    "rating": 4.1},
  {  "id":7,
    "title":"Mary Berry's whole roasted trout" ,
    "imageurl": "https://img.jamieoliver.com/jamieoliver/recipe-database/100210185.jpg?tr=w-800,h-1066",
    "ingredients": "",
    "shortdescription": "Simply cooked with delicate fresh herbs, lemon and tomatoes, this whole roasted trout is a real treat. ",
    "fulldescription": "Preheat the oven to 180°C/350°F/gas 4.\n    Peel the onion and finely slice with the tomatoes and lemon. Roughly chop the dill and parsley (stalks and all).\n    Drizzle a large baking tray with oil, scatter over a third of the sliced tomato, lemon and herbs, then top with the fish, seasoning the cavity and skin with sea salt and black pepper.\n    Stuff the cavity with another third of the sliced tomato, lemon and herbs, then scatter the remaining third over the top – arranging a few tomatoes around the fish. Dot with butter, then drizzle all over with 2 tablespoons of oil and a twist of black pepper.\n    Roast for 25 minutes, or until just cooked through. Delicious served with samphire.\n\n",
    "rating": 3.9},
  {  "id":8,
    "title":"Chipotle-fried fish & clementine bites" ,
    "imageurl": "https://img.jamieoliver.com/jamieoliver/recipe-database/63227643.jpg?tr=w-800,h-1066",
    "ingredients": "",
    "shortdescription": "",
    "fulldescription": "Cut the fish into 2.5cm chunks, season with sea salt and black pepper, squeeze over the juice of 1 lime and set aside for 10 minutes.\n    Pick and finely chop most of the fresh coriander leaves for the dip (reserving some for a garnish) and stir through the yoghurt in a small bowl.\n    Peel and crush the garlic, and add to the yoghurt along with the zest of the clementine half. Season to taste and set aside.\n    Crush the chipotle flakes using a pestle and mortar. Transfer to a large, shallow dish with the ground coriander, cornflour and a pinch of salt, then mix well. Pour the milk into a separate bowl.\n    Pour the oil into a large, thick-bottomed saucepan to a depth of around 6cm (it should be no more than two-thirds full). Heat it to 170ºC/325ºF (if you don’t have a thermometer, dip the end of a wooden spoon in the oil – if it starts bubbling rapidly around the spoon, it’s ready).\n    Slice the clementines as thinly as you can – about 1mm. This can be fiddly, so don’t worry about getting perfect rounds.\n    Pat the fish and clementine slices with kitchen paper to soak up any excess juice. Coat them in the cornflour, then dip briefly in the milk before coating again in flour, shaking off the excess.\n    Deep fry the fish and clementine in batches for 2 to 3 minutes, or until golden.\n    Drain on kitchen paper and scatter with salt, chipotle and the reserved coriander. Serve immediately with the dip and the remaining lime cut into wedges.\n\n",
    "rating": 3.7},
  {  "id":9,
    "title":"Orange polenta cake" ,
    "imageurl": "https://img.jamieoliver.com/jamieoliver/recipe-database/55846372.jpg?tr=w-800,h-1066",
    "ingredients": "",
    "shortdescription": "",
    "fulldescription": "Preheat the oven to 160ºC/325ºF/gas 3. Rub a 20cm springform cake tin with olive oil, then line the base with greaseproof paper and rub the paper with oil, too.\n    Squeeze the juice of 3 oranges (roughly 100ml) into a pan, add 100g of honey and simmer until thickened and reduced, then remove from the heat.\n    Meanwhile, in a free-standing mixer on a high speed, whisk 200ml of olive oil with the remaining 150g of honey for 2 minutes to combine.\n    Beat in the eggs for 2 minutes, while you finely grate and add the zest of 3 oranges.\n    Stop the mixer, then fold in the ground almonds, polenta, and the juice of 1 or 2 oranges (roughly 50ml).\n    Pour into the prepared tin and bake for 40 to 50 minutes, or until golden and cooked through. Leave to cool for 10 minutes in the tin, loosening with a palette knife before releasing – be gentle with it.\n    To serve, quickly peel and slice the remaining oranges and dish up alongside the cake, drizzling the pretty syrup over everything before tucking in.\n\n",
    "rating": 4.8},
  {  "id":10,
    "title":"Granola Dust energy balls" ,
    "imageurl": "https://img.jamieoliver.com/jamieoliver/recipe-database/124048426.jpg?tr=w-800,h-1066",
    "ingredients": "",
    "shortdescription": "These super-nutritious Granola Dust energy balls are perfect for snacking on the go – 3 energy balls equals 1 serving.",
    "fulldescription": "Put 2 tablespoons of Granola Dust aside in a shallow bowl or airtight container and set aside.\n    Place the remaining Granola Dust in a food processor with the honey, cocoa powder and vanilla extract, then zest in the orange and squeeze in half of the juice.\n    Blitz for 1 to 2 minutes, stopping to scrape down the sides a couple of times, and adding an extra squeeze of orange juice to bind, if needed – it takes a while for the mixture to come together, so be patient and let the processor work its magic.\n    With wet hands, divide into 18 and roll into balls, dropping them into the remaining Granola Dust as you go.\n    Shake to coat, storing them in the excess dust until needed. They’ll keep happily for up to 2 weeks in an airtight container.\n\n",
    "rating": 2.6},
  {  "id": 11,
    "title":"Rolled cassata" ,
    "imageurl": "https://img.jamieoliver.com/jamieoliver/recipe-database/77878471.jpg?tr=w-800,h-1066",
    "ingredients": "",
    "shortdescription": "The Arabic influence in Sicilian desserts really sings out in this cassata of silky smooth ricotta with chunks of nuts and chocolate, all wrapped up in Vin Santo sponge and pistachio marzipan. I love this rolled version. ",
    "fulldescription": "Preheat the oven to 180°C/350ºF/gas 4. For the sponge, whisk the eggs and sugar with an electric mixer, or by hand, until pale, fluffy and at least doubled in size. Sift in the flour, add the vanilla paste, then slowly fold through. Grease a baking tray (26cm x 36cm) with butter, then line it with greaseproof paper and grease that, too. Spoon the batter into the tray and bake for 12 to 15 minutes, or until cooked through. Meanwhile, blitz the pistachios in a food processor until fine. Break in the marzipan and blitz until it forms a dough, adding a splash of water to combine, if needed.\n\nTake the sponge out of the oven and confidently flip it out on to a clean tea towel. Peel off the greaseproof, place it back on top, then roll up while the sponge is still warm and flexible. Leave to cool for around 20 minutes.\n\nFor the filling, whiz the ricotta with the sugar in a food processor until smooth. Toast the hazelnuts in a frying pan until golden, then finely chop with the glacé fruit, pistachios and chocolate. Mix into the ricotta.\n\nRoll out most of the marzipan on a large sheet of greaseproof paper to 26cm x 46cm, and 2mm thick. Spread over the jam, unroll the sponge on top, drizzle over the Vin Santo and spread over the ricotta. Line up the cherries along the side nearest you, then, using the paper to help you, roll it up, pressing lightly to seal. Trim the ends, then roll out the remaining marzipan and stamp out shapes to decorate the top. Serve it after 30 minutes’ chilling in the fridge, or freeze for another day. If frozen, defrost in the fridge for 3 hours before serving. Dust with icing sugar to finish. ",
    "rating": 4.1},
  {  "id":12,
    "title":"Martin Clunes' Mallorcan paella" ,
    "imageurl": "https://img.jamieoliver.com/jamieoliver/recipe-database/83619422.jpg?tr=w-800,h-1066",
    "ingredients": "",
    "shortdescription": "Igniting fond memories of happy childhood holidays for Martin, my take on a Mallorcan paella brimming with beautiful seafood is a real flavour extravaganza. Use a mixture of whatever lovely seasonal shellfish you can get your hands on. ",
    "fulldescription": "Preheat the oven to 190ºC/375ºF/gas 5.\n    Peel the prawns, leaving the tails on, then put in the fridge. Place the heads and shells in a pan with the saffron, pour over the stock, then simmer over a low heat to infuse.\n    Dice the chicken and pork into 3cm chunks, then toss with the paprika and a pinch of sea salt and black pepper.\n    Place a large ovenproof frying or paella pan on a medium heat with 1 tablespoon of olive oil. Add the meat and cook for 10 to 15 minutes, or until golden, stirring occasionally, while you peel and finely chop the onion, garlic and celery.\n    Remove the meat to a plate and stir the chopped veg into the fat in the pan. Cook for 10 minutes, or until softened, then return the meat to the mix.\n    At the same time, quickly drop the crayfish into the stock to cook for 4 minutes, remove with a slotted spoon, halve lengthways and place in a large bowl.\n    Cut a cross into the bottom of each tomato, plunge them into the stock for 40 seconds, then carefully peel, deseed and roughly chop.\n    Stir the paella rice into the meat pan to toast for a few minutes, then ladle in 1 litre of stock through a sieve. Add the tomatoes and simmer for 10 minutes, or until the liquid has reduced and the rice is nearly cooked, stirring occasionally.\n    Meanwhile, pick and finely chop the parsley. Run the tip of a knife down the back of each prawn and pull out the vein, meaning they’ll butterfly as they cook.\n    Slice the tentacles from the squid, keeping them whole, then open out the tubes and lightly score in a criss-cross fashion with a regular eating knife.\n    Place the prawns, squid and mussels in the crayfish bowl with the drained artichokes, most of the parsley and the mangetout (roughly slice, if you like), then dress with a drizzle of extra virgin olive oil, the juice of 1 lemon and a good pinch of sea salt and black pepper.\n    Poke and scatter the contents of the bowl into the rice, then place uncovered in the oven for 10 minutes, or until beautifully cooked. Scatter over the remaining parsley leaves and serve with lots of lemon wedges for squeezing over.\n\n",
    "rating": 5.0},
  {  "id":13,
    "title":"Avocado pastry quiche" ,
    "imageurl": "https://img.jamieoliver.com/jamieoliver/recipe-database/114372927.jpg?tr=w-800,h-1066",
    "ingredients": "",
    "shortdescription": "Add a bit of sunshine to your lunch with this beautifully vibrant quiche. I have to say, using avocado in the pastry was a bit of a revelation for me – you’re gonna love it. ",
    "fulldescription": "Halve, destone and peel the avocados. Weigh the flesh – you want 200g to get your ratios right (if you don’t have enough, simply top up to 200g with extra virgin olive oil). In a large bowl, smash up the avo, then gradually rub in the flour, a pinch of sea salt and 4 tablespoons of cold water until you have a dough. Knead until smooth, then wrap and rest for 15 minutes. For the filling, crack the eggs into a blender, then add the frozen peas and most of the Cheddar. Rip in the top leafy half of the basil, add a pinch of salt and black pepper, and blitz until smooth.\n\nPreheat the oven to 200°C/400°F/gas 6. Roll out the avocado pastry on a flour-dusted surface to just under ½cm thick. Loosely roll it up around the rolling pin, then unroll it over an oiled 25cm x 35cm baking tray, ease it into the sides and prick the base. Roughly tear off any big bits of overhang, then bake for 10 minutes, or until lightly golden. Evenly pour in the filling and bake for another 15 minutes, or until set, then finely grate over the remaining cheese. Dress the salad leaves with extra virgin olive oil and lemon juice, season, then sprinkle over the quiche to serve. ",
    "rating": 4.8},
  {  "id":14,
    "title":"Sausage linguine" ,
    "imageurl": "https://img.jamieoliver.com/jamieoliver/recipe-database/77878570.jpg?tr=w-800,h-1066",
    "ingredients": "",
    "shortdescription": "The philosophy that a little can go a long way is so important, just as this dish proves. Being able to buy small amounts of ingredients as you need them, like one sausage, is a great reason to shop at markets. Go on, do it!",
    "fulldescription": "Cook the pasta in a pan of boiling salted water according to the packet instructions, then drain, reserving a mugful of starchy cooking water.\n\nMeanwhile, trim the broccoletti (halving any thick stalks lengthways to make them more delicate to eat). Place a large frying pan on a medium heat with 1 tablespoon of olive oil. Squeeze the sausagemeat out of the skin into the pan, breaking it up with a wooden spoon. Once lightly golden, peel, roughly chop and add the garlic, followed by the anchovies, chilli flakes, broccoletti and wine. Leave to bubble away while the pasta cooks.\n\nToss the drained pasta into the sausage pan, then finely grate over the pecorino and drizzle with extra virgin olive oil. Toss again, loosening with a little reserved cooking water, if needed, to create a light, creamy sauce. Taste and season to perfection, then serve right away. ",
    "rating": 3.9}
]
